GopalSaraf/Practicals/PSDL/include/proc/pic16f17124.inc
// Register: ADREF
#define ADREF ADREF
ADREF                                    equ 01D2Bh
// bitfield definitions
ADREF_PREF_POSN                          equ 0000h
ADREF_PREF_POSITION                      equ 0000h
ADREF_PREF_SIZE                          equ 0004h
ADREF_PREF_LENGTH                        equ 0004h
ADREF_PREF_MASK                          equ 000Fh
ADREF_ADPREF_POSN                        equ 0000h
ADREF_ADPREF_POSITION                    equ 0000h
ADREF_ADPREF_SIZE                        equ 0004h
ADREF_ADPREF_LENGTH                      equ 0004h
ADREF_ADPREF_MASK                        equ 000Fh
ADREF_PREF0_POSN                         equ 0000h
ADREF_PREF0_POSITION                     equ 0000h
ADREF_PREF0_SIZE                         equ 0001h
ADREF_PREF0_LENGTH                       equ 0001h
ADREF_PREF0_MASK                         equ 0001h
ADREF_PREF1_POSN                         equ 0001h
ADREF_PREF1_POSITION                     equ 0001h
ADREF_PREF1_SIZE                         equ 0001h
ADREF_PREF1_LENGTH                       equ 0001h
ADREF_PREF1_MASK                         equ 0002h
ADREF_ADPREF0_POSN                       equ 0000h
ADREF_ADPREF0_POSITION                   equ 0000h
ADREF_ADPREF0_SIZE                       equ 0001h
ADREF_ADPREF0_LENGTH                     equ 0001h
ADREF_ADPREF0_MASK                       equ 0001h
ADREF_ADPREF1_POSN                       equ 0001h
ADREF_ADPREF1_POSITION                   equ 0001h
ADREF_ADPREF1_SIZE                       equ 0001h
ADREF_ADPREF1_LENGTH                     equ 0001h
ADREF_ADPREF1_MASK                       equ 0002h

// Register: ADACT
#define ADACT ADACT
ADACT                                    equ 01D2Ch
// bitfield definitions
ADACT_ACT_POSN                           equ 0000h
ADACT_ACT_POSITION                       equ 0000h
ADACT_ACT_SIZE                           equ 0006h
ADACT_ACT_LENGTH                         equ 0006h
ADACT_ACT_MASK                           equ 003Fh
ADACT_ADACT0_POSN                        equ 0000h
ADACT_ADACT0_POSITION                    equ 0000h
ADACT_ADACT0_SIZE                        equ 0001h
ADACT_ADACT0_LENGTH                      equ 0001h
ADACT_ADACT0_MASK                        equ 0001h
ADACT_ADACT1_POSN                        equ 0001h
ADACT_ADACT1_POSITION                    equ 0001h
ADACT_ADACT1_SIZE                        equ 0001h
ADACT_ADACT1_LENGTH                      equ 0001h
ADACT_ADACT1_MASK                        equ 0002h
ADACT_ADACT2_POSN                        equ 0002h
ADACT_ADACT2_POSITION                    equ 0002h
ADACT_ADACT2_SIZE                        equ 0001h
ADACT_ADACT2_LENGTH                      equ 0001h
ADACT_ADACT2_MASK                        equ 0004h
ADACT_ADACT3_POSN                        equ 0003h
ADACT_ADACT3_POSITION                    equ 0003h
ADACT_ADACT3_SIZE                        equ 0001h
ADACT_ADACT3_LENGTH                      equ 0001h
ADACT_ADACT3_MASK                        equ 0008h
ADACT_ADACT4_POSN                        equ 0004h
ADACT_ADACT4_POSITION                    equ 0004h
ADACT_ADACT4_SIZE                        equ 0001h
ADACT_ADACT4_LENGTH                      equ 0001h
ADACT_ADACT4_MASK                        equ 0010h
ADACT_ADACT_POSN                         equ 0000h
ADACT_ADACT_POSITION                     equ 0000h
ADACT_ADACT_SIZE                         equ 0006h
ADACT_ADACT_LENGTH                       equ 0006h
ADACT_ADACT_MASK                         equ 003Fh
ADACT_ACT0_POSN                          equ 0000h
ADACT_ACT0_POSITION                      equ 0000h
ADACT_ACT0_SIZE                          equ 0001h
ADACT_ACT0_LENGTH                        equ 0001h
ADACT_ACT0_MASK                          equ 0001h
ADACT_ACT1_POSN                          equ 0001h
ADACT_ACT1_POSITION                      equ 0001h
ADACT_ACT1_SIZE                          equ 0001h
ADACT_ACT1_LENGTH                        equ 0001h
ADACT_ACT1_MASK                          equ 0002h
ADACT_ACT2_POSN                          equ 0002h
ADACT_ACT2_POSITION                      equ 0002h
ADACT_ACT2_SIZE                          equ 0001h
ADACT_ACT2_LENGTH                        equ 0001h
ADACT_ACT2_MASK                          equ 0004h
ADACT_ACT3_POSN                          equ 0003h
ADACT_ACT3_POSITION                      equ 0003h
ADACT_ACT3_SIZE                          equ 0001h
ADACT_ACT3_LENGTH                        equ 0001h
ADACT_ACT3_MASK                          equ 0008h
ADACT_ACT4_POSN                          equ 0004h
ADACT_ACT4_POSITION                      equ 0004h
ADACT_ACT4_SIZE                          equ 0001h
ADACT_ACT4_LENGTH                        equ 0001h
ADACT_ACT4_MASK                          equ 0010h

// Register: ADCLK
#define ADCLK ADCLK
ADCLK                                    equ 01D2Dh
// bitfield definitions
ADCLK_CS_POSN                            equ 0000h
ADCLK_CS_POSITION                        equ 0000h
ADCLK_CS_SIZE                            equ 0006h
ADCLK_CS_LENGTH                          equ 0006h
ADCLK_CS_MASK                            equ 003Fh
ADCLK_ADCS0_POSN                         equ 0000h
ADCLK_ADCS0_POSITION                     equ 0000h
ADCLK_ADCS0_SIZE                         equ 0001h
ADCLK_ADCS0_LENGTH                       equ 0001h
ADCLK_ADCS0_MASK                         equ 0001h
ADCLK_ADCS1_POSN                         equ 0001h
ADCLK_ADCS1_POSITION                     equ 0001h
ADCLK_ADCS1_SIZE                         equ 0001h
ADCLK_ADCS1_LENGTH                       equ 0001h
ADCLK_ADCS1_MASK                         equ 0002h
ADCLK_ADCS2_POSN                         equ 0002h
ADCLK_ADCS2_POSITION                     equ 0002h
ADCLK_ADCS2_SIZE                         equ 0001h
ADCLK_ADCS2_LENGTH                       equ 0001h
ADCLK_ADCS2_MASK                         equ 0004h
ADCLK_ADCS3_POSN                         equ 0003h
ADCLK_ADCS3_POSITION                     equ 0003h
ADCLK_ADCS3_SIZE                         equ 0001h
ADCLK_ADCS3_LENGTH                       equ 0001h
ADCLK_ADCS3_MASK                         equ 0008h
ADCLK_ADCS4_POSN                         equ 0004h
ADCLK_ADCS4_POSITION                     equ 0004h
ADCLK_ADCS4_SIZE                         equ 0001h
ADCLK_ADCS4_LENGTH                       equ 0001h
ADCLK_ADCS4_MASK                         equ 0010h
ADCLK_ADCS5_POSN                         equ 0005h
ADCLK_ADCS5_POSITION                     equ 0005h
ADCLK_ADCS5_SIZE                         equ 0001h
ADCLK_ADCS5_LENGTH                       equ 0001h
ADCLK_ADCS5_MASK                         equ 0020h
ADCLK_ADCS_POSN                          equ 0000h
ADCLK_ADCS_POSITION                      equ 0000h
ADCLK_ADCS_SIZE                          equ 0006h
ADCLK_ADCS_LENGTH                        equ 0006h
ADCLK_ADCS_MASK                          equ 003Fh
ADCLK_CS0_POSN                           equ 0000h
ADCLK_CS0_POSITION                       equ 0000h
ADCLK_CS0_SIZE                           equ 0001h
ADCLK_CS0_LENGTH                         equ 0001h
ADCLK_CS0_MASK                           equ 0001h
ADCLK_CS1_POSN                           equ 0001h
ADCLK_CS1_POSITION                       equ 0001h
ADCLK_CS1_SIZE                           equ 0001h
ADCLK_CS1_LENGTH                         equ 0001h
ADCLK_CS1_MASK                           equ 0002h
ADCLK_CS2_POSN                           equ 0002h
ADCLK_CS2_POSITION                       equ 0002h
ADCLK_CS2_SIZE                           equ 0001h
ADCLK_CS2_LENGTH                         equ 0001h
ADCLK_CS2_MASK                           equ 0004h
ADCLK_CS3_POSN                           equ 0003h
ADCLK_CS3_POSITION                       equ 0003h
ADCLK_CS3_SIZE                           equ 0001h
ADCLK_CS3_LENGTH                         equ 0001h
ADCLK_CS3_MASK                           equ 0008h
ADCLK_CS4_POSN                           equ 0004h
ADCLK_CS4_POSITION                       equ 0004h
ADCLK_CS4_SIZE                           equ 0001h
ADCLK_CS4_LENGTH                         equ 0001h
ADCLK_CS4_MASK                           equ 0010h
ADCLK_CS5_POSN                           equ 0005h
ADCLK_CS5_POSITION                       equ 0005h
ADCLK_CS5_SIZE                           equ 0001h
ADCLK_CS5_LENGTH                         equ 0001h
ADCLK_CS5_MASK                           equ 0020h

// Register: ADCG1A
#define ADCG1A ADCG1A
ADCG1A                                   equ 01D2Eh
// bitfield definitions
ADCG1A_CGA0_POSN                         equ 0000h
ADCG1A_CGA0_POSITION                     equ 0000h
ADCG1A_CGA0_SIZE                         equ 0001h
ADCG1A_CGA0_LENGTH                       equ 0001h
ADCG1A_CGA0_MASK                         equ 0001h
ADCG1A_CGA1_POSN                         equ 0001h
ADCG1A_CGA1_POSITION                     equ 0001h
ADCG1A_CGA1_SIZE                         equ 0001h
ADCG1A_CGA1_LENGTH                       equ 0001h
ADCG1A_CGA1_MASK                         equ 0002h
ADCG1A_CGA2_POSN                         equ 0002h
ADCG1A_CGA2_POSITION                     equ 0002h
ADCG1A_CGA2_SIZE                         equ 0001h
ADCG1A_CGA2_LENGTH                       equ 0001h
ADCG1A_CGA2_MASK                         equ 0004h
ADCG1A_CGA4_POSN                         equ 0004h
ADCG1A_CGA4_POSITION                     equ 0004h
ADCG1A_CGA4_SIZE                         equ 0001h
ADCG1A_CGA4_LENGTH                       equ 0001h
ADCG1A_CGA4_MASK                         equ 0010h
ADCG1A_CGA5_POSN                         equ 0005h
ADCG1A_CGA5_POSITION                     equ 0005h
ADCG1A_CGA5_SIZE                         equ 0001h
ADCG1A_CGA5_LENGTH                       equ 0001h
ADCG1A_CGA5_MASK                         equ 0020h

// Register: ADCG1C
#define ADCG1C ADCG1C
ADCG1C                                   equ 01D30h
// bitfield definitions
ADCG1C_CGC0_POSN                         equ 0000h
ADCG1C_CGC0_POSITION                     equ 0000h
ADCG1C_CGC0_SIZE                         equ 0001h
ADCG1C_CGC0_LENGTH                       equ 0001h
ADCG1C_CGC0_MASK                         equ 0001h
ADCG1C_CGC1_POSN                         equ 0001h
ADCG1C_CGC1_POSITION                     equ 0001h
ADCG1C_CGC1_SIZE                         equ 0001h
ADCG1C_CGC1_LENGTH                       equ 0001h
ADCG1C_CGC1_MASK                         equ 0002h
ADCG1C_CGC2_POSN                         equ 0002h
ADCG1C_CGC2_POSITION                     equ 0002h
ADCG1C_CGC2_SIZE                         equ 0001h
ADCG1C_CGC2_LENGTH                       equ 0001h
ADCG1C_CGC2_MASK                         equ 0004h
ADCG1C_CGC3_POSN                         equ 0003h
ADCG1C_CGC3_POSITION                     equ 0003h
ADCG1C_CGC3_SIZE                         equ 0001h
ADCG1C_CGC3_LENGTH                       equ 0001h
ADCG1C_CGC3_MASK                         equ 0008h
ADCG1C_CGC4_POSN                         equ 0004h
ADCG1C_CGC4_POSITION                     equ 0004h
ADCG1C_CGC4_SIZE                         equ 0001h
ADCG1C_CGC4_LENGTH                       equ 0001h
ADCG1C_CGC4_MASK                         equ 0010h
ADCG1C_CGC5_POSN                         equ 0005h
ADCG1C_CGC5_POSITION                     equ 0005h
ADCG1C_CGC5_SIZE                         equ 0001h
ADCG1C_CGC5_LENGTH                       equ 0001h
ADCG1C_CGC5_MASK                         equ 0020h

// Register: RA0PPS
#define RA0PPS RA0PPS
RA0PPS                                   equ 01D8Ch
// bitfield definitions
RA0PPS_RA0PPS_POSN                       equ 0000h
RA0PPS_RA0PPS_POSITION                   equ 0000h
RA0PPS_RA0PPS_SIZE                       equ 0006h
RA0PPS_RA0PPS_LENGTH                     equ 0006h
RA0PPS_RA0PPS_MASK                       equ 003Fh

// Register: RA1PPS
#define RA1PPS RA1PPS
RA1PPS                                   equ 01D8Dh
// bitfield definitions
RA1PPS_RA1PPS_POSN                       equ 0000h
RA1PPS_RA1PPS_POSITION                   equ 0000h
RA1PPS_RA1PPS_SIZE                       equ 0006h
RA1PPS_RA1PPS_LENGTH                     equ 0006h
RA1PPS_RA1PPS_MASK                       equ 003Fh

// Register: RA2PPS
#define RA2PPS RA2PPS
RA2PPS                                   equ 01D8Eh
// bitfield definitions
RA2PPS_RA2PPS_POSN                       equ 0000h
RA2PPS_RA2PPS_POSITION                   equ 0000h
RA2PPS_RA2PPS_SIZE                       equ 0006h
RA2PPS_RA2PPS_LENGTH                     equ 0006h
RA2PPS_RA2PPS_MASK                       equ 003Fh

// Register: RA4PPS
#define RA4PPS RA4PPS
RA4PPS                                   equ 01D90h
// bitfield definitions
RA4PPS_RA4PPS_POSN                       equ 0000h
RA4PPS_RA4PPS_POSITION                   equ 0000h
RA4PPS_RA4PPS_SIZE                       equ 0006h
RA4PPS_RA4PPS_LENGTH                     equ 0006h
RA4PPS_RA4PPS_MASK                       equ 003Fh

